FemDesign.Supports.LineSupport
line_support_type

FemDesign.Supports.LineSupport.EdgeNormal
This property only reflects the edge normal. If this normal is changed arcs may transform.

FemDesign.Supports.LineSupport.#ctor
Parameterless constructor for serialization.

FemDesign.Supports.LineSupport.#ctor(FemDesign.Geometry.Edge,FemDesign.Geometry.Vector3d,System.Boolean,FemDesign.Releases.MotionType,System.Double,System.Double,System.Double,System.Double,System.String)
Create a 1-dimensionally directed line support. Recomended to use 3-dimensional supports. These are constructor with FemDesign.Releases.Motions and FemDesign.Releases.Rotations parameters.
edge: Position of the support.
direction: Positive direction of the support.
movingLocal: Keep direction along line (false) or Direction changes along line (true).
type: Motion or rotation stiffness.
pos: Support stiffness in positive direction. [kN/m] or [kNm/°]
neg: Support stiffness in negative direction. [kN/m] or [kNm/°]
posPlastic: Plastic limit in positive direction. [kN] or [kNm]
negPlastic: Plastic limit in negative direction. [kN] or [kNm]
identifier: Name.

FemDesign.Supports.LineSupport.#ctor(FemDesign.Geometry.Edge,FemDesign.Releases.Motions,FemDesign.Releases.Rotations,System.Boolean,System.String)
LineSupport along edge with rigidity (motions, rotations). Group LCS aligned with edge LCS.
edge: Position of the support.
motions: Motions stiffnessess.
rotations: Rotation stiffnessess.
movingLocal: Keep direction along line (false) or Direction changes along line (true).
identifier: Name.

FemDesign.Supports.LineSupport.#ctor(FemDesign.Geometry.Edge,FemDesign.Releases.Motions,FemDesign.Releases.MotionsPlasticLimits,FemDesign.Releases.Rotations,FemDesign.Releases.RotationsPlasticLimits,System.Boolean,System.String)
LineSupport along edge with rigidity (motions, rotations) and plastic limits (forces, moments). Group LCS aligned with edge LCS.
edge: Position of the support.
motions: Motions stiffnessess.
motionsPlasticLimits: Motions plastic limit forces.
rotations: Rotation stiffnessess.
rotationsPlasticLimits: Rotation plastic limit moments.
movingLocal: Keep direction along line (false) or Direction changes along line (true).
identifier: Name.

FemDesign.Supports.LineSupport.Rigid(FemDesign.Geometry.Edge,System.Boolean,System.String)
Rigid LineSupport along edge.
edge: Position of the support.
movingLocal: Keep direction along line (false) or Direction changes along line (true).
identifier: Name.

FemDesign.Supports.LineSupport.Hinged(FemDesign.Geometry.Edge,System.Boolean,System.String)
Hinged LineSupport along edge.
edge: Position of the support.
movingLocal: Keep direction along line (false) or Direction changes along line (true).
identifier: Name.